{
  "modelTopology": {
    "keras_version": "2.8.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same",
              "input_shape": [224, 224, 3]
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {}
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.25
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {}
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.25
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 128,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {}
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.25
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 256,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {}
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2],
              "strides": [2, 2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.25
            }
          },
          {
            "class_name": "Flatten",
            "config": {}
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 512,
              "activation": "relu"
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {}
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.5
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 256,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "rate": 0.5
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 4,
              "activation": "softmax"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": []
    }
  ]
}
